controllers/AutoresponseController.php

UPDATE `we_auto_response` SET `ar_rule_name`='eeee', `ar_type`='基本文字回复', `ar_wd`='eeeeeeeeefewf', `ar_content`='eeeeee' WHERE ar_id='25'
---
    public function actionUpdate()
    {
        $post= Yii::$app->request->post();
        $id=$post['hid'];
        $ar_rule_name=$post['m_rule_name'];
        $ar_type=$post['m_rule_type'];
        $ar_wd=$post['m_wd'];
        $ar_content=$post['m_content'];
        $connection=\Yii::$app->db;
        // UPDATE
        $request=$connection->createCommand()->update('we_auto_response', [
            'ar_rule_name' => $ar_rule_name,
            'ar_type' =>$ar_type,
            'ar_wd' =>$ar_wd,
            'ar_content' =>$ar_content
        ], "ar_id='$id'")->execute();